Seeing the same issue when attempting to upgrade to v3. Plan should not show any changes.

```
  # helm_release.karpenter_crd will be updated in-place
  ~ resource "helm_release" "karpenter_crd" {
      ~ id                         = "karpenter-crd" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "1.5.1" -> (known after apply)
          ~ chart          = "karpenter-crd" -> (known after apply)
          ~ first_deployed = 1712580704 -> (known after apply)
          ~ last_deployed  = 1750671991 -> (known after apply)
          ~ name           = "karpenter-crd" -> (known after apply)
          ~ namespace      = "kube-system" -> (known after apply)
          + notes          = (known after apply)
          ~ revision       = 17 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "1.5.1" -> (known after apply)
        } -> (known after apply)
        name                       = "karpenter-crd"
      - postrender                 = {
          - args        = [] -> null
          - binary_path = "" -> null
        } -> null
      - set                        = [] -> null
      - set_list                   = [] -> null
      - set_sensitive              = [] -> null
      - set_wo_revision            = 1 -> null
        # (27 unchanged attributes hidden)
    }
```

If the diff is expected, then it should be mentioned explicitly in the [upgrade guide](https://github.com/hashicorp/terraform-provider-helm/blob/v3.0.0/docs/guides/v3-upgrade-guide.md). But ideally, the diff should be empty!